#### Terraform Format and Style 🖌`success`
#### Terraform Security Scan 🔒`success`

#### tfsec Security Scan 🔒

- **AVD-AWS-0102**: Network ACL rule allows access using ALL ports.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:512

- **AVD-AWS-0102**: Network ACL rule allows access using ALL ports.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:495

- **AVD-AWS-0102**: Network ACL rule allows access using ALL ports.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:330

- **AVD-AWS-0102**: Network ACL rule allows access using ALL ports.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:313

- **AVD-AWS-0102**: Network ACL rule allows access using ALL ports.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:211

- **AVD-AWS-0102**: Network ACL rule allows access using ALL ports.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:194

- **AVD-AWS-0104**: Security group rule allows egress to multiple public internet addresses.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-eks?ref=a713f6f464eb579a39918f60f130a5fbb77a6b30/node_groups.tf:247

- **AVD-AWS-0105**: Network ACL rule allows ingress from public internet.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:496

- **AVD-AWS-0105**: Network ACL rule allows ingress from public internet.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:314

- **AVD-AWS-0105**: Network ACL rule allows ingress from public internet.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:195

- **AVD-AWS-0178**: VPC Flow Logs is not enabled for VPC 
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-vpc?ref=f7f84f70ad6db36e4eae0273bf08ed2ffd0a69c4/main.tf:28

- **AVD-AWS-0031**: Repository tags are mutable.
  - Severity: HIGH
  - Location: /github/workspace/modules/ecr/main.tf:20

- **AVD-AWS-0033**: Repository is not encrypted using KMS.
  - Severity: LOW
  - Location: /github/workspace/modules/ecr/main.tf:18

- **AVD-AWS-0038**: Control plane scheduler logging is not enabled.
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-eks?ref=a713f6f464eb579a39918f60f130a5fbb77a6b30/main.tf:35

- **AVD-AWS-0038**: Control plane controller manager logging is not enabled.
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-eks?ref=a713f6f464eb579a39918f60f130a5fbb77a6b30/main.tf:35

- **AVD-AWS-0040**: Public cluster access is enabled.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-eks?ref=a713f6f464eb579a39918f60f130a5fbb77a6b30/main.tf:69

- **AVD-AWS-0041**: Cluster allows access from a public CIDR: 0.0.0.0/0.
  - Severity: CRITICAL
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-eks?ref=a713f6f464eb579a39918f60f130a5fbb77a6b30/main.tf:70

- **AVD-AWS-0123**: Multi-Factor authentication is not enforced for group
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-iam?ref=416c5ccda8807632b505888d55ca83c3b71282a8/modules/iam-group-with-policies/main.tf:5

- **AVD-AWS-0123**: Multi-Factor authentication is not enforced for group
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-iam?ref=416c5ccda8807632b505888d55ca83c3b71282a8/modules/iam-group-with-policies/main.tf:5

- **AVD-AWS-0123**: Multi-Factor authentication is not enforced for group
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-iam?ref=416c5ccda8807632b505888d55ca83c3b71282a8/modules/iam-group-with-assumable-roles-policy/main.tf:18

- **AVD-AWS-0123**: Multi-Factor authentication is not enforced for group
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-iam?ref=416c5ccda8807632b505888d55ca83c3b71282a8/modules/iam-group-with-assumable-roles-policy/main.tf:18

- **AVD-AWS-0066**: Function does not have tracing enabled.
  - Severity: LOW
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-lambda?ref=e2500c0d4698bc81801ecf18c2cfa41d6bf8e087/main.tf:24

- **AVD-AWS-0177**: Instance does not have Deletion Protection enabled
  - Severity: MEDIUM
  - Location: /github/workspace/modules/rds/main.tf:82

- **AVD-AWS-0078**: Instance has performance insights enabled without encryption.
  - Severity: HIGH
  - Location: /github/workspace/modules/rds/main.tf:54

- **AVD-AWS-0080**: Instance does not have storage encryption enabled.
  - Severity: HIGH
  - Location: /github/workspace/modules/rds/main.tf:54

- **AVD-AWS-0077**: Instance has very low backup retention period.
  - Severity: MEDIUM
  - Location: /github/workspace/modules/rds/main.tf:80

- **AVD-AWS-0088**: Bucket does not have encryption enabled
  - Severity: HIGH
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-s3-bucket?ref=1eb6a5766e0a84168d6e8aed2ccfa83e667a9561/main.tf:25

- **AVD-AWS-0089**: Bucket does not have logging enabled
  - Severity: MEDIUM
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-s3-bucket?ref=1eb6a5766e0a84168d6e8aed2ccfa83e667a9561/main.tf:25

- **AVD-AWS-0132**: Bucket does not encrypt data with a customer managed key.
  - Severity: HIGH
  - Location: git::https:/github.com/terraform-aws-modules/terraform-aws-s3-bucket?ref=1eb6a5766e0a84168d6e8aed2ccfa83e667a9561/main.tf:25


#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.
```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.external.archive_prepare[0]: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-][0m
[0m[1mmodule.network.data.aws_availability_zones.available: Reading...[0m[0m
[0m[1mmodule.network.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1][0m
[0m[1mdata.aws_availability_zones.available: Reading...[0m[0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455][0m
[0m[1mmodule.eks.data.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.network.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0942df3048e39f7e9][0m
[0m[1mmodule.iam.module.user_developers[2].aws_iam_user.this[0]: Refreshing state... [id=lekan][0m
[0m[1mmodule.iam.module.user_developers[1].aws_iam_user.this[0]: Refreshing state... [id=peter][0m
[0m[1mmodule.iam.module.user_developers[0].aws_iam_user.this[0]: Refreshing state... [id=samuel][0m
[0m[1mmodule.eks.module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.artifact.aws_kms_key.this: Refreshing state... [id=5695f7f2-b256-46dc-9816-e79e27c0ad22][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.rds.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.iam.module.user_devops[2].aws_iam_user.this[0]: Refreshing state... [id=saul][0m
[0m[1mmodule.rds.data.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.iam.module.eks_cluster_role.data.aws_iam_policy_document.assume_role[0]: Reading...[0m[0m
[0m[1mmodule.iam.module.eks_cluster_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3943213819][0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.iam.module.user_devops[0].aws_iam_user.this[0]: Refreshing state... [id=sammy][0m
[0m[1mmodule.iam.module.user_devops[1].aws_iam_user.this[0]: Refreshing state... [id=joseph][0m
[0m[1mdata.aws_availability_zones.available: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.eks.module.eks.module.eks_managed_node_group["default_node_group"].data.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_canonical_user_id.this[0]: Reading...[0m[0m
[0m[1mmodule.rds.module.secret_manager.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.rds.module.lambda_rds.module.lambda.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.rds.module.secret_manager.data.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.eks.module.eks.module.kms.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.amplify.data.aws_ssm_parameter.github_pat["angularuiform"]: Reading...[0m[0m
[0m[1mmodule.amplify.data.aws_ssm_parameter.github_pat["popupuibackend"]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_caller_identity.current: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mmodule.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799][0m
[0m[1mmodule.eks.module.eks.data.aws_iam_session_context.current[0]: Reading...[0m[0m
[0m[1mmodule.iam.module.eks_cluster_role.aws_iam_role.this[0]: Refreshing state... [id=AmazonEKSClusterRole][0m
[0m[1mmodule.iam.module.user_developers[0].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA6LJLWZ7VHSH475N7][0m
[0m[1mmodule.iam.module.user_developers[2].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA6LJLWZ7VL23WCP4L][0m
[0m[1mmodule.iam.module.user_developers[1].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA6LJLWZ7VLZDVXJ55][0m
[0m[1mmodule.iam.module.user_developers[1].aws_iam_user_login_profile.this[0]: Refreshing state... [id=peter][0m
[0m[1mmodule.s3.module.s3_bucket[0].data.aws_canonical_user_id.this[0]: Read complete after 0s [id=51df51ce4795b766a64b750146ef4984882d8c51d697bc0e57e962a1d274c4a3][0m
[0m[1mmodule.iam.module.user_developers[2].aws_iam_user_login_profile.this[0]: Refreshing state... [id=lekan][0m
[0m[1mmodule.eks.module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::986323537898:assumed-role/openid-gha-role/GitHubActions][0m
[0m[1mmodule.iam.module.user_developers[0].aws_iam_user_login_profile.this[0]: Refreshing state... [id=samuel][0m
[0m[1mmodule.artifact.aws_codeartifact_domain.this: Refreshing state... [id=arn:aws:codeartifact:us-east-1:986323537898:domain/dex-backend][0m
[0m[1mmodule.rds.module.secret_manager.module.secrets_manager.data.aws_iam_policy_document.this[0]: Reading...[0m[0m
[0m[1mmodule.rds.module.secret_manager.module.secrets_manager.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4216717818][0m
[0m[1mmodule.iam.module.user_devops[1].aws_iam_user_login_profile.this[0]: Refreshing state... [id=joseph][0m
[0m[1mmodule.iam.module.user_devops[2].aws_iam_user_login_profile.this[0]: Refreshing state... [id=saul][0m
[0m[1mmodule.iam.module.user_devops[0].aws_iam_user_login_profile.this[0]: Refreshing state... [id=sammy][0m
[0m[1mmodule.iam.module.user_devops[1].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA6LJLWZ7VDDGKY5IM][0m
[0m[1mmodule.iam.module.user_devops[2].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA6LJLWZ7VEMEEGXHT][0m
[0m[1mmodule.iam.module.user_devops[0].aws_iam_access_key.this_no_pgp[0]: Refreshing state... [id=AKIA6LJLWZ7VAZ44SIMX][0m
[0m[1mmodule.eks.module.eks.data.aws_iam_policy_document.custom[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117][0m
[0m[1mmodule.iam.module.eks_cluster_role.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=AmazonEKSClusterRole-2025051412141516790000000a][0m
[0m[1mmodule.amplify.data.aws_ssm_parameter.github_pat["angularuiform"]: Read complete after 0s [id=/amplify/public][0m
[0m[1mmodule.amplify.data.aws_ssm_parameter.github_pat["popupuibackend"]: Read complete after 0s [id=/amplify/public][0m
[0m[1mmodule.iam.module.iam_group_developers.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_developers_with_assumed_roles.aws_iam_group.this: Refreshing state... [id=developers-with_assumed_roles][0m
[0m[1mmodule.iam.module.iam_group_developers.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.iam.module.iam_group_developers_with_assumed_roles.data.aws_iam_policy_document.assume_role: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_developers.aws_iam_group.this[0]: Refreshing state... [id=developers][0m
[0m[1mmodule.iam.module.iam_group_developers.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_developers_with_assumed_roles.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2993689567][0m
[0m[1mmodule.iam.module.iam_group_developers_with_assumed_roles.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::986323537898:policy/developers-with_assumed_roles][0m
[0m[1mmodule.iam.module.iam_group_developers.data.aws_caller_identity.current[0]: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.iam.module.iam_group_devops.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_devops.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_devops.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.iam.module.iam_group_devops_with_assumed_roles.aws_iam_group.this: Refreshing state... [id=devops-with_AssumedRoles][0m
[0m[1mmodule.iam.module.iam_group_devops_with_assumed_roles.data.aws_iam_policy_document.assume_role: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_developers.data.aws_iam_policy_document.iam_self_management: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_devops_with_assumed_roles.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2993689567][0m
[0m[1mmodule.iam.module.iam_group_devops.aws_iam_group.this[0]: Refreshing state... [id=devops][0m
[0m[1mmodule.iam.module.iam_group_devops_with_assumed_roles.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::986323537898:policy/devops-with_AssumedRoles][0m
[0m[1mmodule.iam.module.iam_group_developers.data.aws_iam_policy_document.iam_self_management: Read complete after 0s [id=571272153][0m
[0m[1mmodule.iam.module.iam_group_devops.data.aws_caller_identity.current[0]: Read complete after 0s [id=986323537898][0m
[0m[1mmodule.iam.module.iam_group_developers.aws_iam_policy.iam_self_management[0]: Refreshing state... [id=arn:aws:iam::986323537898:policy/IAMSelfManagement-2025051412141543250000000c][0m
[0m[1mmodule.iam.module.iam_group_devops.data.aws_iam_policy_document.iam_self_management: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_devops.data.aws_iam_policy_document.iam_self_management: Read complete after 0s [id=571272153][0m
[0m[1mmodule.iam.module.iam_group_devops.aws_iam_policy.iam_self_management[0]: Refreshing state... [id=arn:aws:iam::986323537898:policy/IAMSelfManagement-2025051412141518750000000b][0m
[0m[1mmodule.iam.module.iam_group_developers_with_assumed_roles.aws_iam_group_membership.this[0]: Refreshing state... [id=developers-with_assumed_roles][0m
[0m[1mmodule.iam.module.iam_group_developers.aws_iam_group_membership.this[0]: Refreshing state... [id=developers][0m
[0m[1mmodule.iam.module.iam_group_developers.aws_iam_group_policy_attachment.custom_arns[0]: Refreshing state... [id=developers-20250514121416108100000011][0m
[0m[1mmodule.iam.module.iam_group_devops_with_assumed_roles.aws_iam_group_membership.this[0]: Refreshing state... [id=devops-with_AssumedRoles][0m
[0m[1mmodule.iam.module.iam_group_devops.aws_iam_group_membership.this[0]: Refreshing state... [id=devops][0m
[0m[1mmodule.iam.module.iam_group_devops.aws_iam_group_policy_attachment.custom_arns[0]: Refreshing state... [id=devops-2025051412141576850000000d][0m
[0m[1mmodule.artifact.data.aws_codeartifact_authorization_token.this: Reading...[0m[0m
[0m[1mmodule.artifact.aws_codeartifact_repository.this["rubygems"]: Refreshing state... [id=arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-rubygems][0m
[0m[1mmodule.artifact.aws_codeartifact_repository.this["nuget"]: Refreshing state... [id=arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-nuget][0m
[0m[1mmodule.artifact.aws_codeartifact_repository.this["pypi"]: Refreshing state... [id=arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-pypi][0m
[0m[1mmodule.artifact.aws_codeartifact_repository.this["maven"]: Refreshing state... [id=arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-maven][0m
[0m[1mmodule.artifact.aws_codeartifact_repository.this["npm"]: Refreshing state... [id=arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-npm][0m
[0m[1mmodule.artifact.data.aws_iam_policy_document.artifactPolicy: Reading...[0m[0m
[0m[1mmodule.iam.module.iam_group_developers_with_assumed_roles.aws_iam_group_policy_attachment.this: Refreshing state... [id=developers-with_assumed_roles-20250514121416024000000010][0m
[0m[1mmodule.artifact.data.aws_iam_policy_document.artifactPolicy: Read complete after 0s [id=908611171][0m
[0m[1mmodule.iam.module.iam_group_devops.aws_iam_group_policy_attachment.iam_self_management[0]: Refreshing state... [id=devops-2025051412141588260000000f][0m
[0m[1mmodule.iam.module.iam_group_devops_with_assumed_roles.aws_iam_group_policy_attachment.this: Refreshing state... [id=devops-with_AssumedRoles-2025051412141578880000000e][0m
[0m[1mmodule.artifact.aws_codeartifact_domain_permissions_policy.test: Refreshing state... [id=arn:aws:codeartifact:us-east-1:986323537898:domain/dex-backend][0m
[0m[1mmodule.artifact.data.aws_codeartifact_authorization_token.this: Read complete after 1s [id=986323537898:dex-backend][0m
[0m[1mmodule.iam.module.iam_group_developers.aws_iam_group_policy_attachment.iam_self_management[0]: Refreshing state... [id=developers-20250514121416110500000012][0m
[0m[1mmodule.network.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-08ea92d9dd995ca89][0m
[0m[1mmodule.network.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0edba88209af8d4ec][0m
[0m[1mmodule.network.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d0da2d9092274a56][0m
[0m[1mmodule.network.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f328b0a46a53029a][0m
[0m[1mmodule.network.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-07d8f3b98032f229d][0m
[0m[1mmodule.network.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0c0a69a30f4a10478][0m
[0m[1mmodule.network.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06b541ff1b636a724][0m
[0m[1mmodule.network.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07d015da787f9a669][0m
[0m[1mmodule.network.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08c7299bacbda65d4][0m
[0m[1mmodule.network.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-098c7ee60fb5386f5][0m
[0m[1mmodule.network.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-071fec278a5cf994a][0m
[0m[1mmodule.network.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a0927fadad706792][0m
[0m[1mmodule.network.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0294d1b67b415cc60][0m
[0m[1mmodule.network.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08c7299bacbda65d41080289494][0m
[0m[1mmodule.network.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-055ab5878ae9ac67c][0m
[0m[1mmodule.network.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0ad57dc6d84681da9][0m
[0m[1mmodule.network.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-065ef437d8da1dfce][0m
[0m[1mmodule.network.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cf4666acc2915074][0m
[0m[1mmodule.network.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=dex-backend-us-east-1-vpc][0m
[0m[1mmodule.network.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-061dab8173f814302][0m
[0m[1mmodule.network.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06706bfaaa9e8972a][0m
[0m[1mmodule.network.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-080a619c1f7db35b5][0m
[0m[1mmodule.network.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f328b0a46a53029a1080289494][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [31m-[0m destroy[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.amplify.aws_amplify_app.frontend["angularuiform"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_app" "frontend" {
      [32m+[0m[0m access_token      = (sensitive value)
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m build_spec        = <<-EOT
            version: 1
            frontend:
              phases:
                preBuild:
                  commands:
                    - npm ci
                build:
                  commands:
                    - npm run build
              artifacts:
                baseDirectory: dist/angular-pwa
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
        EOT
      [32m+[0m[0m custom_headers    = (known after apply)
      [32m+[0m[0m default_domain    = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m name              = "dex-backend-us-east-1-angularuiform"
      [32m+[0m[0m platform          = "WEB"
      [32m+[0m[0m production_branch = (known after apply)
      [32m+[0m[0m repository        = "https://github.com/aws-samples/aws-amplify-angular-sample"
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m custom_rule {
          [32m+[0m[0m source = "/<*>"
          [32m+[0m[0m status = "404"
          [32m+[0m[0m target = "/index.html"
        }
      [32m+[0m[0m custom_rule {
          [32m+[0m[0m source = "/api/*"
          [32m+[0m[0m status = "200"
          [32m+[0m[0m target = "/api/index.html"
        }
    }

[1m  # module.amplify.aws_amplify_app.frontend["popupuibackend"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_app" "frontend" {
      [32m+[0m[0m access_token      = (sensitive value)
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m build_spec        = <<-EOT
            version: 1
            backend:
              phases:
                build:
                  commands:
                    - '# Execute Amplify CLI with the helper script'
                    - amplifyPush --simple
            frontend:
              phases:
                preBuild:
                  commands:
                    - yarn install
                build:
                  commands:
                    - yarn run build
              artifacts:
                baseDirectory: build
                files:
                  - '**/*'
              cache:
                paths:
                  - node_modules/**/*
            
            test:
              phases:
                preTest:
                  commands:
                    - npm ci
                    - npm install -g pm2
                    - npm install -g wait-on
                    - npm install mocha mochawesome mochawesome-merge mochawesome-report-generator
                    - pm2 start npm -- start
                    - wait-on http://localhost:3000
                test:
                  commands:
                    - 'npx cypress run --reporter mochawesome --reporter-options "reportDir=cypress/report/mochawesome-report,overwrite=false,html=false,json=true,timestamp=mmddyyyy_HHMMss"'
                postTest:
                  commands:
                    - npx mochawesome-merge cypress/report/mochawesome-report/mochawesome*.json > cypress/report/mochawesome.json
                    - pm2 kill
              artifacts:
                baseDirectory: cypress
                configFilePath: '**/mochawesome.json'
                files:
                  - '**/*.png'
                  - '**/*.mp4'
        EOT
      [32m+[0m[0m custom_headers    = (known after apply)
      [32m+[0m[0m default_domain    = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m name              = "dex-backend-us-east-1-popupuibackend"
      [32m+[0m[0m platform          = "WEB"
      [32m+[0m[0m production_branch = (known after apply)
      [32m+[0m[0m repository        = "https://github.com/aws-samples/aws-amplify-react-sample"
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m custom_rule {
          [32m+[0m[0m source = "/<*>"
          [32m+[0m[0m status = "404"
          [32m+[0m[0m target = "/index.html"
        }
      [32m+[0m[0m custom_rule {
          [32m+[0m[0m source = "/api/*"
          [32m+[0m[0m status = "200"
          [32m+[0m[0m target = "/api/index.html"
        }
    }

[1m  # module.amplify.aws_amplify_backend_environment.backend["popupuibackend"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_backend_environment" "backend" {
      [32m+[0m[0m app_id               = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m deployment_artifacts = (known after apply)
      [32m+[0m[0m environment_name     = "popupuibac"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m stack_name           = (known after apply)
    }

[1m  # module.amplify.aws_amplify_branch.main_branch["angularuiform"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_branch" "main_branch" {
      [32m+[0m[0m app_id               = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m associated_resources = (known after apply)
      [32m+[0m[0m branch_name          = "main"
      [32m+[0m[0m custom_domains       = (known after apply)
      [32m+[0m[0m destination_branch   = (known after apply)
      [32m+[0m[0m display_name         = (known after apply)
      [32m+[0m[0m enable_auto_build    = true
      [32m+[0m[0m framework            = "Angular"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m source_branch        = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.amplify.aws_amplify_branch.main_branch["popupuibackend"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_branch" "main_branch" {
      [32m+[0m[0m app_id               = (known after apply)
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m associated_resources = (known after apply)
      [32m+[0m[0m branch_name          = "main"
      [32m+[0m[0m custom_domains       = (known after apply)
      [32m+[0m[0m destination_branch   = (known after apply)
      [32m+[0m[0m display_name         = (known after apply)
      [32m+[0m[0m enable_auto_build    = true
      [32m+[0m[0m framework            = "React"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m source_branch        = (known after apply)
      [32m+[0m[0m tags                 = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.amplify.aws_amplify_domain_association.domain_association["angularuiform"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_domain_association" "domain_association" {
      [32m+[0m[0m app_id                              = (known after apply)
      [32m+[0m[0m arn                                 = (known after apply)
      [32m+[0m[0m certificate_verification_dns_record = (known after apply)
      [32m+[0m[0m domain_name                         = "awsamplifyapp.com"
      [32m+[0m[0m enable_auto_sub_domain              = false
      [32m+[0m[0m id                                  = (known after apply)
      [32m+[0m[0m wait_for_verification               = false

      [32m+[0m[0m sub_domain {
          [32m+[0m[0m branch_name = "main"
          [32m+[0m[0m dns_record  = (known after apply)
          [32m+[0m[0m prefix      = "main"
          [32m+[0m[0m verified    = (known after apply)
        }
    }

[1m  # module.amplify.aws_amplify_domain_association.domain_association["popupuibackend"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_domain_association" "domain_association" {
      [32m+[0m[0m app_id                              = (known after apply)
      [32m+[0m[0m arn                                 = (known after apply)
      [32m+[0m[0m certificate_verification_dns_record = (known after apply)
      [32m+[0m[0m domain_name                         = "awsamplifyapp.com"
      [32m+[0m[0m enable_auto_sub_domain              = false
      [32m+[0m[0m id                                  = (known after apply)
      [32m+[0m[0m wait_for_verification               = false

      [32m+[0m[0m sub_domain {
          [32m+[0m[0m branch_name = "main"
          [32m+[0m[0m dns_record  = (known after apply)
          [32m+[0m[0m prefix      = "main"
          [32m+[0m[0m verified    = (known after apply)
        }
    }

[1m  # module.amplify.aws_amplify_webhook.main["angularuiform"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_webhook" "main" {
      [32m+[0m[0m app_id      = (known after apply)
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m branch_name = "main"
      [32m+[0m[0m description = "triggermaster"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m url         = (known after apply)
    }

[1m  # module.amplify.aws_amplify_webhook.main["popupuibackend"][0m will be created
[0m  [32m+[0m[0m resource "aws_amplify_webhook" "main" {
      [32m+[0m[0m app_id      = (known after apply)
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m branch_name = "main"
      [32m+[0m[0m description = "triggermaster"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m url         = (known after apply)
    }

[1m  # module.artifact.data.aws_codeartifact_repository_endpoint.this["npm"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_codeartifact_repository_endpoint" "this" {
      [32m+[0m[0m domain              = "dex-backend"
      [32m+[0m[0m domain_owner        = (known after apply)
      [32m+[0m[0m format              = "npm"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m repository          = "devpkg-npm"
      [32m+[0m[0m repository_endpoint = (known after apply)
    }

[1m  # module.artifact.data.aws_codeartifact_repository_endpoint.this["pypi"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_codeartifact_repository_endpoint" "this" {
      [32m+[0m[0m domain              = "dex-backend"
      [32m+[0m[0m domain_owner        = (known after apply)
      [32m+[0m[0m format              = "pypi"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m repository          = "devpkg-pypi"
      [32m+[0m[0m repository_endpoint = (known after apply)
    }

[1m  # module.artifact.aws_codeartifact_repository.this["maven"][0m will be [1m[31mdestroyed[0m
  # (because key ["maven"] is not in for_each map)
[0m  [31m-[0m[0m resource "aws_codeartifact_repository" "this" {
      [31m-[0m[0m administrator_account = "986323537898" [90m-> null[0m[0m
      [31m-[0m[0m arn                   = "arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-maven" [90m-> null[0m[0m
      [31m-[0m[0m description           = "Code Artifact Repo for dex-backend" [90m-> null[0m[0m
      [31m-[0m[0m domain                = "dex-backend" [90m-> null[0m[0m
      [31m-[0m[0m domain_owner          = "986323537898" [90m-> null[0m[0m
      [31m-[0m[0m id                    = "arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-maven" [90m-> null[0m[0m
      [31m-[0m[0m repository            = "devpkg-maven" [90m-> null[0m[0m
      [31m-[0m[0m tags                  = {
          [31m-[0m[0m "Environment" = "dex-backend"
          [31m-[0m[0m "Owner"       = "dex-backend"
          [31m-[0m[0m "Terraform"   = "true"
        } [90m-> null[0m[0m
      [31m-[0m[0m tags_all              = {
          [31m-[0m[0m "Environment" = "dex-backend"
          [31m-[0m[0m "Owner"       = "dex-backend"
          [31m-[0m[0m "Terraform"   = "true"
        } [90m-> null[0m[0m

      [31m-[0m[0m external_connections {
          [31m-[0m[0m external_connection_name = "public:maven-central" [90m-> null[0m[0m
          [31m-[0m[0m package_format           = "maven" [90m-> null[0m[0m
          [31m-[0m[0m status                   = "AVAILABLE" [90m-> null[0m[0m
        }
    }

[1m  # module.artifact.aws_codeartifact_repository.this["nuget"][0m will be [1m[31mdestroyed[0m
  # (because key ["nuget"] is not in for_each map)
[0m  [31m-[0m[0m resource "aws_codeartifact_repository" "this" {
      [31m-[0m[0m administrator_account = "986323537898" [90m-> null[0m[0m
      [31m-[0m[0m arn                   = "arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-nuget" [90m-> null[0m[0m
      [31m-[0m[0m description           = "Code Artifact Repo for dex-backend" [90m-> null[0m[0m
      [31m-[0m[0m domain                = "dex-backend" [90m-> null[0m[0m
      [31m-[0m[0m domain_owner          = "986323537898" [90m-> null[0m[0m
      [31m-[0m[0m id                    = "arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-nuget" [90m-> null[0m[0m
      [31m-[0m[0m repository            = "devpkg-nuget" [90m-> null[0m[0m
      [31m-[0m[0m tags                  = {
          [31m-[0m[0m "Environment" = "dex-backend"
          [31m-[0m[0m "Owner"       = "dex-backend"
          [31m-[0m[0m "Terraform"   = "true"
        } [90m-> null[0m[0m
      [31m-[0m[0m tags_all              = {
          [31m-[0m[0m "Environment" = "dex-backend"
          [31m-[0m[0m "Owner"       = "dex-backend"
          [31m-[0m[0m "Terraform"   = "true"
        } [90m-> null[0m[0m
    }

[1m  # module.artifact.aws_codeartifact_repository.this["rubygems"][0m will be [1m[31mdestroyed[0m
  # (because key ["rubygems"] is not in for_each map)
[0m  [31m-[0m[0m resource "aws_codeartifact_repository" "this" {
      [31m-[0m[0m administrator_account = "986323537898" [90m-> null[0m[0m
      [31m-[0m[0m arn                   = "arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-rubygems" [90m-> null[0m[0m
      [31m-[0m[0m description           = "Code Artifact Repo for dex-backend" [90m-> null[0m[0m
      [31m-[0m[0m domain                = "dex-backend" [90m-> null[0m[0m
      [31m-[0m[0m domain_owner          = "986323537898" [90m-> null[0m[0m
      [31m-[0m[0m id                    = "arn:aws:codeartifact:us-east-1:986323537898:repository/dex-backend/devpkg-rubygems" [90m-> null[0m[0m
      [31m-[0m[0m repository            = "devpkg-rubygems" [90m-> null[0m[0m
      [31m-[0m[0m tags                  = {
          [31m-[0m[0m "Environment" = "dex-backend"
          [31m-[0m[0m "Owner"       = "dex-backend"
          [31m-[0m[0m "Terraform"   = "true"
        } [90m-> null[0m[0m
      [31m-[0m[0m tags_all              = {
          [31m-[0m[0m "Environment" = "dex-backend"
          [31m-[0m[0m "Owner"       = "dex-backend"
          [31m-[0m[0m "Terraform"   = "true"
        } [90m-> null[0m[0m
    }

[1m  # module.artifact.aws_codeartifact_repository_permissions_policy.this["npm"][0m will be created
[0m  [32m+[0m[0m resource "aws_codeartifact_repository_permissions_policy" "this" {
      [32m+[0m[0m domain          = "dex-backend"
      [32m+[0m[0m domain_owner    = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m policy_document = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "codeartifact:*"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = "*"
                      [32m+[0m[0m Resource  = "arn:aws:codeartifact:us-east-1:986323537898:domain/dex-backend"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_revision = (known after apply)
      [32m+[0m[0m repository      = "devpkg-npm"
      [32m+[0m[0m resource_arn    = (known after apply)
    }

[1m  # module.artifact.aws_codeartifact_repository_permissions_policy.this["pypi"][0m will be created
[0m  [32m+[0m[0m resource "aws_codeartifact_repository_permissions_policy" "this" {
      [32m+[0m[0m domain          = "dex-backend"
      [32m+[0m[0m domain_owner    = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m policy_document = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "codeartifact:*"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = "*"
                      [32m+[0m[0m Resource  = "arn:aws:codeartifact:us-east-1:986323537898:domain/dex-backend"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_revision = (known after apply)
      [32m+[0m[0m repository      = "devpkg-pypi"
      [32m+[0m[0m resource_arn    = (known after apply)
    }

[1m  # module.artifact.time_sleep.wait_for_external_connections[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "wait_for_external_connections" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.ecr.aws_ecr_account_setting.registry_policy_scope[0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_account_setting" "registry_policy_scope" {
      [32m+[0m[0m name  = "REGISTRY_POLICY_SCOPE"
      [32m+[0m[0m value = "V2"
    }

[1m  # module.ecr.aws_ecr_lifecycle_policy.this[0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m rules = [
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Keep last 10 tagged images"
                      [32m+[0m[0m rulePriority = 1
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber   = 10
                          [32m+[0m[0m countType     = "imageCountMoreThan"
                          [32m+[0m[0m tagPrefixList = [
                              [32m+[0m[0m "v",
                            ]
                          [32m+[0m[0m tagStatus     = "tagged"
                        }
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Expire untagged images older than 14 days"
                      [32m+[0m[0m rulePriority = 2
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber = 14
                          [32m+[0m[0m countType   = "sinceImagePushed"
                          [32m+[0m[0m countUnit   = "days"
                          [32m+[0m[0m tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = "dex-backend"
    }

[1m  # module.ecr.aws_ecr_registry_scanning_configuration.this[0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_registry_scanning_configuration" "this" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m scan_type   = "ENHANCED"

      [32m+[0m[0m rule {
          [32m+[0m[0m scan_frequency = "SCAN_ON_PUSH"

          [32m+[0m[0m repository_filter {
              [32m+[0m[0m filter      = "*"
              [32m+[0m[0m filter_type = "WILDCARD"
            }
        }
    }

[1m  # module.ecr.aws_ecr_repository.this[0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository" "this" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m image_tag_mutability = "MUTABLE"
      [32m+[0m[0m name                 = "dex-backend"
      [32m+[0m[0m registry_id          = (known after apply)
      [32m+[0m[0m repository_url       = (known after apply)
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m image_scanning_configuration {
          [32m+[0m[0m scan_on_push = true
        }
    }

[1m  # module.eks.data.aws_eks_cluster_auth.cluster[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_cluster_auth" "cluster" {
      [32m+[0m[0m id    = (known after apply)
      [32m+[0m[0m name  = "dex-backend-us-east-1-eks"
      [32m+[0m[0m token = (sensitive value)
    }

[1m  # module.eks.data.aws_iam_openid_connect_provider.oidc_provider[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_openid_connect_provider" "oidc_provider" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m client_id_list  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m tags            = (known after apply)
      [32m+[0m[0m thumbprint_list = (known after apply)
      [32m+[0m[0m url             = (known after apply)
    }

[1m  # module.rds.data.aws_secretsmanager_secret_version.rds_secret_version[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_secretsmanager_secret_version" "rds_secret_version" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m created_date   = (known after apply)
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m secret_binary  = (sensitive value)
      [32m+[0m[0m secret_id      = (known after apply)
      [32m+[0m[0m secret_string  = (sensitive value)
      [32m+[0m[0m version_id     = (known after apply)
      [32m+[0m[0m version_stage  = "AWSCURRENT"
      [32m+[0m[0m version_stages = (known after apply)
    }

[1m  # module.rds.aws_db_instance.master[0][0m will be created
[0m  [32m+[0m[0m resource "aws_db_instance" "master" {
      [32m+[0m[0m address                               = (known after apply)
      [32m+[0m[0m allocated_storage                     = 20
      [32m+[0m[0m allow_major_version_upgrade           = true
      [32m+[0m[0m apply_immediately                     = false
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m auto_minor_version_upgrade            = true
      [32m+[0m[0m availability_zone                     = (known after apply)
      [32m+[0m[0m backup_retention_period               = 1
      [32m+[0m[0m backup_target                         = (known after apply)
      [32m+[0m[0m backup_window                         = "03:00-06:00"
      [32m+[0m[0m ca_cert_identifier                    = (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [32m+[0m[0m copy_tags_to_snapshot                 = false
      [32m+[0m[0m database_insights_mode                = (known after apply)
      [32m+[0m[0m db_name                               = "dbmaster"
      [32m+[0m[0m db_subnet_group_name                  = "dex-backend-us-east-1-vpc"
      [32m+[0m[0m dedicated_log_volume                  = false
      [32m+[0m[0m delete_automated_backups              = true
      [32m+[0m[0m deletion_protection                   = false
      [32m+[0m[0m domain_fqdn                           = (known after apply)
      [32m+[0m[0m enabled_cloudwatch_logs_exports       = [
          [32m+[0m[0m "postgresql",
          [32m+[0m[0m "upgrade",
        ]
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m engine                                = "postgres"
      [32m+[0m[0m engine_lifecycle_support              = (known after apply)
      [32m+[0m[0m engine_version                        = "17.5"
      [32m+[0m[0m engine_version_actual                 = (known after apply)
      [32m+[0m[0m hosted_zone_id                        = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m identifier                            = "dex-backend-us-east-1-db-master"
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [32m+[0m[0m instance_class                        = "db.t3.micro"
      [32m+[0m[0m iops                                  = (known after apply)
      [32m+[0m[0m kms_key_id                            = (known after apply)
      [32m+[0m[0m latest_restorable_time                = (known after apply)
      [32m+[0m[0m license_model                         = (known after apply)
      [32m+[0m[0m listener_endpoint                     = (known after apply)
      [32m+[0m[0m maintenance_window                    = "mon:00:00-mon:03:00"
      [32m+[0m[0m master_user_secret                    = (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m max_allocated_storage                 = 50
      [32m+[0m[0m monitoring_interval                   = 60
      [32m+[0m[0m monitoring_role_arn                   = (known after apply)
      [32m+[0m[0m multi_az                              = true
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [32m+[0m[0m network_type                          = (known after apply)
      [32m+[0m[0m option_group_name                     = (known after apply)
      [32m+[0m[0m parameter_group_name                  = "dex-backend-us-east-1-db-master"
      [32m+[0m[0m password                              = (sensitive value)
      [32m+[0m[0m performance_insights_enabled          = true
      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)
      [32m+[0m[0m performance_insights_retention_period = 7
      [32m+[0m[0m port                                  = 5432
      [32m+[0m[0m publicly_accessible                   = false
      [32m+[0m[0m replica_mode                          = (known after apply)
      [32m+[0m[0m replicas                              = (known after apply)
      [32m+[0m[0m resource_id                           = (known after apply)
      [32m+[0m[0m skip_final_snapshot                   = true
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [32m+[0m[0m status                                = (known after apply)
      [32m+[0m[0m storage_throughput                    = (known after apply)
      [32m+[0m[0m storage_type                          = (known after apply)
      [32m+[0m[0m tags                                  = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m timezone                              = (known after apply)
      [32m+[0m[0m username                              = (known after apply)
      [32m+[0m[0m vpc_security_group_ids                = (known after apply)
    }

[1m  # module.rds.aws_db_instance.master[1][0m will be created
[0m  [32m+[0m[0m resource "aws_db_instance" "master" {
      [32m+[0m[0m address                               = (known after apply)
      [32m+[0m[0m allocated_storage                     = 20
      [32m+[0m[0m allow_major_version_upgrade           = true
      [32m+[0m[0m apply_immediately                     = false
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m auto_minor_version_upgrade            = true
      [32m+[0m[0m availability_zone                     = (known after apply)
      [32m+[0m[0m backup_retention_period               = 1
      [32m+[0m[0m backup_target                         = (known after apply)
      [32m+[0m[0m backup_window                         = "03:00-06:00"
      [32m+[0m[0m ca_cert_identifier                    = (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [32m+[0m[0m copy_tags_to_snapshot                 = false
      [32m+[0m[0m database_insights_mode                = (known after apply)
      [32m+[0m[0m db_name                               = "testmaster"
      [32m+[0m[0m db_subnet_group_name                  = "dex-backend-us-east-1-vpc"
      [32m+[0m[0m dedicated_log_volume                  = false
      [32m+[0m[0m delete_automated_backups              = true
      [32m+[0m[0m deletion_protection                   = false
      [32m+[0m[0m domain_fqdn                           = (known after apply)
      [32m+[0m[0m enabled_cloudwatch_logs_exports       = [
          [32m+[0m[0m "postgresql",
          [32m+[0m[0m "upgrade",
        ]
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m engine                                = "postgres"
      [32m+[0m[0m engine_lifecycle_support              = (known after apply)
      [32m+[0m[0m engine_version                        = "17.5"
      [32m+[0m[0m engine_version_actual                 = (known after apply)
      [32m+[0m[0m hosted_zone_id                        = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m identifier                            = "dex-backend-us-east-1-test-master"
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [32m+[0m[0m instance_class                        = "db.t3.micro"
      [32m+[0m[0m iops                                  = (known after apply)
      [32m+[0m[0m kms_key_id                            = (known after apply)
      [32m+[0m[0m latest_restorable_time                = (known after apply)
      [32m+[0m[0m license_model                         = (known after apply)
      [32m+[0m[0m listener_endpoint                     = (known after apply)
      [32m+[0m[0m maintenance_window                    = "mon:00:00-mon:03:00"
      [32m+[0m[0m master_user_secret                    = (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m max_allocated_storage                 = 30
      [32m+[0m[0m monitoring_interval                   = 60
      [32m+[0m[0m monitoring_role_arn                   = (known after apply)
      [32m+[0m[0m multi_az                              = true
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [32m+[0m[0m network_type                          = (known after apply)
      [32m+[0m[0m option_group_name                     = (known after apply)
      [32m+[0m[0m parameter_group_name                  = "dex-backend-us-east-1-test-master"
      [32m+[0m[0m password                              = (sensitive value)
      [32m+[0m[0m performance_insights_enabled          = true
      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)
      [32m+[0m[0m performance_insights_retention_period = 7
      [32m+[0m[0m port                                  = 5432
      [32m+[0m[0m publicly_accessible                   = false
      [32m+[0m[0m replica_mode                          = (known after apply)
      [32m+[0m[0m replicas                              = (known after apply)
      [32m+[0m[0m resource_id                           = (known after apply)
      [32m+[0m[0m skip_final_snapshot                   = true
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [32m+[0m[0m status                                = (known after apply)
      [32m+[0m[0m storage_throughput                    = (known after apply)
      [32m+[0m[0m storage_type                          = (known after apply)
      [32m+[0m[0m tags                                  = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m timezone                              = (known after apply)
      [32m+[0m[0m username                              = (known after apply)
      [32m+[0m[0m vpc_security_group_ids                = (known after apply)
    }

[1m  # module.rds.aws_db_instance.replica["db"][0m will be created
[0m  [32m+[0m[0m resource "aws_db_instance" "replica" {
      [32m+[0m[0m address                               = (known after apply)
      [32m+[0m[0m allocated_storage                     = (known after apply)
      [32m+[0m[0m apply_immediately                     = false
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m auto_minor_version_upgrade            = true
      [32m+[0m[0m availability_zone                     = (known after apply)
      [32m+[0m[0m backup_retention_period               = 0
      [32m+[0m[0m backup_target                         = (known after apply)
      [32m+[0m[0m backup_window                         = "03:00-06:00"
      [32m+[0m[0m ca_cert_identifier                    = (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [32m+[0m[0m copy_tags_to_snapshot                 = false
      [32m+[0m[0m database_insights_mode                = (known after apply)
      [32m+[0m[0m db_name                               = (known after apply)
      [32m+[0m[0m db_subnet_group_name                  = (known after apply)
      [32m+[0m[0m dedicated_log_volume                  = false
      [32m+[0m[0m delete_automated_backups              = true
      [32m+[0m[0m deletion_protection                   = false
      [32m+[0m[0m domain_fqdn                           = (known after apply)
      [32m+[0m[0m enabled_cloudwatch_logs_exports       = [
          [32m+[0m[0m "postgresql",
          [32m+[0m[0m "upgrade",
        ]
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m engine                                = "postgres"
      [32m+[0m[0m engine_lifecycle_support              = (known after apply)
      [32m+[0m[0m engine_version                        = "17.5"
      [32m+[0m[0m engine_version_actual                 = (known after apply)
      [32m+[0m[0m hosted_zone_id                        = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m identifier                            = "dex-backend-us-east-1-db-replica"
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [32m+[0m[0m instance_class                        = "db.t3.micro"
      [32m+[0m[0m iops                                  = (known after apply)
      [32m+[0m[0m kms_key_id                            = (known after apply)
      [32m+[0m[0m latest_restorable_time                = (known after apply)
      [32m+[0m[0m license_model                         = (known after apply)
      [32m+[0m[0m listener_endpoint                     = (known after apply)
      [32m+[0m[0m maintenance_window                    = "tue:00:00-tue:03:00"
      [32m+[0m[0m master_user_secret                    = (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m monitoring_interval                   = 0
      [32m+[0m[0m monitoring_role_arn                   = (known after apply)
      [32m+[0m[0m multi_az                              = false
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [32m+[0m[0m network_type                          = (known after apply)
      [32m+[0m[0m option_group_name                     = (known after apply)
      [32m+[0m[0m parameter_group_name                  = "dex-backend-us-east-1-db-replica"
      [32m+[0m[0m performance_insights_enabled          = false
      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)
      [32m+[0m[0m performance_insights_retention_period = (known after apply)
      [32m+[0m[0m port                                  = 5432
      [32m+[0m[0m publicly_accessible                   = false
      [32m+[0m[0m replica_mode                          = (known after apply)
      [32m+[0m[0m replicas                              = (known after apply)
      [32m+[0m[0m replicate_source_db                   = "dex-backend-us-east-1-db-master"
      [32m+[0m[0m resource_id                           = (known after apply)
      [32m+[0m[0m skip_final_snapshot                   = true
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [32m+[0m[0m status                                = (known after apply)
      [32m+[0m[0m storage_encrypted                     = false
      [32m+[0m[0m storage_throughput                    = (known after apply)
      [32m+[0m[0m storage_type                          = (known after apply)
      [32m+[0m[0m tags                                  = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m timezone                              = (known after apply)
      [32m+[0m[0m username                              = (known after apply)
      [32m+[0m[0m vpc_security_group_ids                = (known after apply)
    }

[1m  # module.rds.aws_db_parameter_group.master[0][0m will be created
[0m  [32m+[0m[0m resource "aws_db_parameter_group" "master" {
      [32m+[0m[0m arn          = (known after apply)
      [32m+[0m[0m description  = "Managed by Terraform"
      [32m+[0m[0m family       = "postgres17"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m name         = "dex-backend-us-east-1-db-master"
      [32m+[0m[0m name_prefix  = (known after apply)
      [32m+[0m[0m skip_destroy = false
      [32m+[0m[0m tags         = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all     = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m parameter {
          [32m+[0m[0m apply_method = "immediate"
          [32m+[0m[0m name         = "autovacuum"
          [32m+[0m[0m value        = "1"
        }
      [32m+[0m[0m parameter {
          [32m+[0m[0m apply_method = "immediate"
          [32m+[0m[0m name         = "client_encoding"
          [32m+[0m[0m value        = "utf8"
        }
    }

[1m  # module.rds.aws_db_parameter_group.master[1][0m will be created
[0m  [32m+[0m[0m resource "aws_db_parameter_group" "master" {
      [32m+[0m[0m arn          = (known after apply)
      [32m+[0m[0m description  = "Managed by Terraform"
      [32m+[0m[0m family       = "postgres17"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m name         = "dex-backend-us-east-1-test-master"
      [32m+[0m[0m name_prefix  = (known after apply)
      [32m+[0m[0m skip_destroy = false
      [32m+[0m[0m tags         = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all     = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m parameter {
          [32m+[0m[0m apply_method = "immediate"
          [32m+[0m[0m name         = "autovacuum"
          [32m+[0m[0m value        = "1"
        }
      [32m+[0m[0m parameter {
          [32m+[0m[0m apply_method = "immediate"
          [32m+[0m[0m name         = "client_encoding"
          [32m+[0m[0m value        = "utf8"
        }
    }

[1m  # module.rds.aws_db_parameter_group.replica["db"][0m will be created
[0m  [32m+[0m[0m resource "aws_db_parameter_group" "replica" {
      [32m+[0m[0m arn          = (known after apply)
      [32m+[0m[0m description  = "Managed by Terraform"
      [32m+[0m[0m family       = "postgres17"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m name         = "dex-backend-us-east-1-db-replica"
      [32m+[0m[0m name_prefix  = (known after apply)
      [32m+[0m[0m skip_destroy = false
      [32m+[0m[0m tags         = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all     = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m parameter {
          [32m+[0m[0m apply_method = "immediate"
          [32m+[0m[0m name         = "autovacuum"
          [32m+[0m[0m value        = "1"
        }
      [32m+[0m[0m parameter {
          [32m+[0m[0m apply_method = "immediate"
          [32m+[0m[0m name         = "client_encoding"
          [32m+[0m[0m value        = "utf8"
        }
    }

[1m  # module.rds.aws_iam_role.rds_monitoring_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "rds_monitoring_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "rds-monitoring-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.rds.aws_iam_role_policy_attachment.rds_monitoring_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "rds_monitoring_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      [32m+[0m[0m role       = "rds-monitoring-role"
    }

[1m  # module.rds.aws_secretsmanager_secret_version.rds_secret_version_update["db"][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_version" "rds_secret_version_update" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m has_secret_string_wo = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m secret_id            = (known after apply)
      [32m+[0m[0m secret_string        = (sensitive value)
      [32m+[0m[0m version_id           = (known after apply)
      [32m+[0m[0m version_stages       = [
          [32m+[0m[0m "AWSCURRENT",
        ]
    }

[1m  # module.rds.aws_secretsmanager_secret_version.rds_secret_version_update["test"][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_version" "rds_secret_version_update" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m has_secret_string_wo = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m secret_id            = (known after apply)
      [32m+[0m[0m secret_string        = (sensitive value)
      [32m+[0m[0m version_id           = (known after apply)
      [32m+[0m[0m version_stages       = [
          [32m+[0m[0m "AWSCURRENT",
        ]
    }

[1m  # module.eks.module.eks.data.aws_eks_addon_version.this["coredns"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "this" {
      [32m+[0m[0m addon_name         = "coredns"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.32"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # module.eks.module.eks.data.aws_eks_addon_version.this["eks-node-monitoring-agent"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "this" {
      [32m+[0m[0m addon_name         = "eks-node-monitoring-agent"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.32"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # module.eks.module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "this" {
      [32m+[0m[0m addon_name         = "eks-pod-identity-agent"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.32"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "this" {
      [32m+[0m[0m addon_name         = "kube-proxy"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.32"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "this" {
      [32m+[0m[0m addon_name         = "vpc-cni"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.32"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # module.eks.module.eks.data.tls_certificate.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "tls_certificate" "this" {
      [32m+[0m[0m certificates = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m url          = (known after apply)
    }

[1m  # module.eks.module.eks.aws_cloudwatch_log_group.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "this" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/eks/dex-backend-us-east-1-eks/cluster"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 90
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Name"        = "/aws/eks/dex-backend-us-east-1-eks/cluster"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Name"        = "/aws/eks/dex-backend-us-east-1-eks/cluster"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "cluster_primary_security_group" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "Environment"
      [32m+[0m[0m resource_id = (known after apply)
      [32m+[0m[0m value       = "dex-backend"
    }

[1m  # module.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Terraform"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "cluster_primary_security_group" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "Terraform"
      [32m+[0m[0m resource_id = (known after apply)
      [32m+[0m[0m value       = "true"
    }

[1m  # module.eks.module.eks.aws_eks_access_entry.this["cluster_creator"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_access_entry" "this" {
      [32m+[0m[0m access_entry_arn  = (known after apply)
      [32m+[0m[0m cluster_name      = (known after apply)
      [32m+[0m[0m created_at        = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m kubernetes_groups = (known after apply)
      [32m+[0m[0m modified_at       = (known after apply)
      [32m+[0m[0m principal_arn     = "arn:aws:iam::986323537898:role/openid-gha-role"
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m type              = "STANDARD"
      [32m+[0m[0m user_name         = (known after apply)
    }

[1m  # module.eks.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_access_policy_association" "this" {
      [32m+[0m[0m associated_at = (known after apply)
      [32m+[0m[0m cluster_name  = (known after apply)
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m modified_at   = (known after apply)
      [32m+[0m[0m policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      [32m+[0m[0m principal_arn = "arn:aws:iam::986323537898:role/openid-gha-role"

      [32m+[0m[0m access_scope {
          [32m+[0m[0m type = "cluster"
        }
    }

[1m  # module.eks.module.eks.aws_eks_addon.before_compute["eks-pod-identity-agent"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "before_compute" {
      [32m+[0m[0m addon_name                  = "eks-pod-identity-agent"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = (known after apply)
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m preserve                    = true
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "OVERWRITE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m timeouts {}
    }

[1m  # module.eks.module.eks.aws_eks_addon.before_compute["vpc-cni"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "before_compute" {
      [32m+[0m[0m addon_name                  = "vpc-cni"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = (known after apply)
      [32m+[0m[0m configuration_values        = jsonencode(
            {
              [32m+[0m[0m env = {
                  [32m+[0m[0m ENABLE_PREFIX_DELEGATION = "true"
                  [32m+[0m[0m WARM_PREFIX_TARGET       = "1"
                }
            }
        )
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m preserve                    = true
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "OVERWRITE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m timeouts {}
    }

[1m  # module.eks.module.eks.aws_eks_addon.this["coredns"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "this" {
      [32m+[0m[0m addon_name                  = "coredns"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = (known after apply)
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m preserve                    = true
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "OVERWRITE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m timeouts {}
    }

[1m  # module.eks.module.eks.aws_eks_addon.this["eks-node-monitoring-agent"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "this" {
      [32m+[0m[0m addon_name                  = "eks-node-monitoring-agent"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = (known after apply)
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m preserve                    = true
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "OVERWRITE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m timeouts {}
    }

[1m  # module.eks.module.eks.aws_eks_addon.this["kube-proxy"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "this" {
      [32m+[0m[0m addon_name                  = "kube-proxy"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = (known after apply)
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m preserve                    = true
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "OVERWRITE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }

      [32m+[0m[0m timeouts {}
    }

[1m  # module.eks.module.eks.aws_eks_cluster.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_cluster" "this" {
      [32m+[0m[0m arn                           = (known after apply)
      [32m+[0m[0m bootstrap_self_managed_addons = true
      [32m+[0m[0m certificate_authority         = (known after apply)
      [32m+[0m[0m cluster_id                    = (known after apply)
      [32m+[0m[0m created_at                    = (known after apply)
      [32m+[0m[0m enabled_cluster_log_types     = [
          [32m+[0m[0m "api",
          [32m+[0m[0m "audit",
          [32m+[0m[0m "authenticator",
        ]
      [32m+[0m[0m endpoint                      = (known after apply)
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m identity                      = (known after apply)
      [32m+[0m[0m name                          = "dex-backend-us-east-1-eks"
      [32m+[0m[0m platform_version              = (known after apply)
      [32m+[0m[0m role_arn                      = (known after apply)
      [32m+[0m[0m status                        = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "Environment"           = "dex-backend"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "eks"
        }
      [32m+[0m[0m tags_all                      = {
          [32m+[0m[0m "Environment"           = "dex-backend"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "eks"
        }
      [32m+[0m[0m version                       = "1.32"

      [32m+[0m[0m access_config {
          [32m+[0m[0m authentication_mode                         = "API_AND_CONFIG_MAP"
          [32m+[0m[0m bootstrap_cluster_creator_admin_permissions = false
        }

      [32m+[0m[0m encryption_config {
          [32m+[0m[0m resources = [
              [32m+[0m[0m "secrets",
            ]

          [32m+[0m[0m provider {
              [32m+[0m[0m key_arn = (known after apply)
            }
        }

      [32m+[0m[0m kubernetes_network_config {
          [32m+[0m[0m ip_family         = "ipv4"
          [32m+[0m[0m service_ipv4_cidr = (known after apply)
          [32m+[0m[0m service_ipv6_cidr = (known after apply)
        }

      [32m+[0m[0m timeouts {}

      [32m+[0m[0m upgrade_policy {
          [32m+[0m[0m support_type = "STANDARD"
        }

      [32m+[0m[0m vpc_config {
          [32m+[0m[0m cluster_security_group_id = (known after apply)
          [32m+[0m[0m endpoint_private_access   = true
          [32m+[0m[0m endpoint_public_access    = true
          [32m+[0m[0m public_access_cidrs       = [
              [32m+[0m[0m "0.0.0.0/0",
            ]
          [32m+[0m[0m security_group_ids        = (known after apply)
          [32m+[0m[0m subnet_ids                = [
              [32m+[0m[0m "subnet-071fec278a5cf994a",
              [32m+[0m[0m "subnet-0a0927fadad706792",
            ]
          [32m+[0m[0m vpc_id                    = (known after apply)
        }

      [32m+[0m[0m zonal_shift_config {
          [32m+[0m[0m enabled = true
        }
    }

[1m  # module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_openid_connect_provider" "oidc_provider" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m client_id_list  = [
          [32m+[0m[0m "sts.amazonaws.com",
        ]
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Name"        = "dex-backend-us-east-1-eks-eks-irsa"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Name"        = "dex-backend-us-east-1-eks-eks-irsa"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m thumbprint_list = (known after apply)
      [32m+[0m[0m url             = (known after apply)
    }

[1m  # module.eks.module.eks.aws_iam_policy.cluster_encryption[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "cluster_encryption" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = "dex-backend-us-east-1-eks-cluster-ClusterEncryption"
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.eks.module.eks.aws_iam_policy.custom[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "custom" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = "dex-backend-us-east-1-eks-cluster-"
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = [
                          [32m+[0m[0m "ec2:RunInstances",
                          [32m+[0m[0m "ec2:CreateLaunchTemplate",
                          [32m+[0m[0m "ec2:CreateFleet",
                        ]
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m StringEquals = {
                              [32m+[0m[0m "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                          [32m+[0m[0m StringLike   = {
                              [32m+[0m[0m "aws:RequestTag/eks:kubernetes-node-class-name" = "*"
                              [32m+[0m[0m "aws:RequestTag/eks:kubernetes-node-pool-name"  = "*"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Resource  = "*"
                      [32m+[0m[0m Sid       = "Compute"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = [
                          [32m+[0m[0m "ec2:CreateVolume",
                          [32m+[0m[0m "ec2:CreateSnapshot",
                        ]
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m StringEquals = {
                              [32m+[0m[0m "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Resource  = [
                          [32m+[0m[0m "arn:aws:ec2:*:*:volume/*",
                          [32m+[0m[0m "arn:aws:ec2:*:*:snapshot/*",
                        ]
                      [32m+[0m[0m Sid       = "Storage"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "ec2:CreateNetworkInterface"
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m StringEquals = {
                              [32m+[0m[0m "aws:RequestTag/eks:eks-cluster-name"         = "${aws:PrincipalTag/eks:eks-cluster-name}"
                              [32m+[0m[0m "aws:RequestTag/eks:kubernetes-cni-node-name" = "*"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Resource  = "*"
                      [32m+[0m[0m Sid       = "Networking"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = [
                          [32m+[0m[0m "elasticloadbalancing:CreateTargetGroup",
                          [32m+[0m[0m "elasticloadbalancing:CreateRule",
                          [32m+[0m[0m "elasticloadbalancing:CreateLoadBalancer",
                          [32m+[0m[0m "elasticloadbalancing:CreateListener",
                          [32m+[0m[0m "ec2:CreateSecurityGroup",
                        ]
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m StringEquals = {
                              [32m+[0m[0m "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Resource  = "*"
                      [32m+[0m[0m Sid       = "LoadBalancer"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "shield:CreateProtection"
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m StringEquals = {
                              [32m+[0m[0m "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Resource  = "*"
                      [32m+[0m[0m Sid       = "ShieldProtection"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "shield:TagResource"
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m StringEquals = {
                              [32m+[0m[0m "aws:RequestTag/eks:eks-cluster-name" = "${aws:PrincipalTag/eks:eks-cluster-name}"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Resource  = "arn:aws:shield::*:protection/*"
                      [32m+[0m[0m Sid       = "ShieldTagResource"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.eks.module.eks.aws_iam_role.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = [
                          [32m+[0m[0m "sts:TagSession",
                          [32m+[0m[0m "sts:AssumeRole",
                        ]
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "eks.amazonaws.com"
                        }
                      [32m+[0m[0m Sid       = "EKSClusterAssumeRole"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m name_prefix           = "dex-backend-us-east-1-eks-cluster-"
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.eks.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.eks.module.eks.aws_iam_role_policy_attachment.custom[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "custom" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.eks.module.eks.aws_security_group.cluster[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "cluster" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "EKS cluster security group"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "dex-backend-us-east-1-eks-cluster-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Name"        = "dex-backend-us-east-1-eks-cluster"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Name"        = "dex-backend-us-east-1-eks-cluster"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m vpc_id                 = "vpc-0942df3048e39f7e9"
    }

[1m  # module.eks.module.eks.aws_security_group.node[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "node" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "EKS node shared security group"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "dex-backend-us-east-1-eks-node-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment"                                     = "dex-backend"
          [32m+[0m[0m "Name"                                            = "dex-backend-us-east-1-eks-node"
          [32m+[0m[0m "Terraform"                                       = "true"
          [32m+[0m[0m "kubernetes.io/cluster/dex-backend-us-east-1-eks" = "owned"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment"                                     = "dex-backend"
          [32m+[0m[0m "Name"                                            = "dex-backend-us-east-1-eks-node"
          [32m+[0m[0m "Terraform"                                       = "true"
          [32m+[0m[0m "kubernetes.io/cluster/dex-backend-us-east-1-eks" = "owned"
        }
      [32m+[0m[0m vpc_id                 = "vpc-0942df3048e39f7e9"
    }

[1m  # module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "cluster" {
      [32m+[0m[0m description              = "Node groups to cluster API"
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.eks.module.eks.aws_security_group_rule.node["egress_all"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow all egress"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "egress"
    }

[1m  # module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Cluster API to node groups"
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Cluster API to node 4443/tcp webhook"
      [32m+[0m[0m from_port                = 4443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 4443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Cluster API to node 6443/tcp webhook"
      [32m+[0m[0m from_port                = 6443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 6443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Cluster API to node 8443/tcp webhook"
      [32m+[0m[0m from_port                = 8443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 8443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Cluster API to node 9443/tcp webhook"
      [32m+[0m[0m from_port                = 9443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 9443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Cluster API to node kubelets"
      [32m+[0m[0m from_port                = 10250
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 10250
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.eks.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Node to node ingress on ephemeral ports"
      [32m+[0m[0m from_port                = 1025
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = true
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 65535
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Node to node CoreDNS"
      [32m+[0m[0m from_port                = 53
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = true
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 53
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Node to node CoreDNS UDP"
      [32m+[0m[0m from_port                = 53
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "udp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = true
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 53
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.eks.module.eks.time_sleep.this[0][0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "this" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m triggers        = {
          [32m+[0m[0m "cluster_certificate_authority_data" = (known after apply)
          [32m+[0m[0m "cluster_endpoint"                   = (known after apply)
          [32m+[0m[0m "cluster_name"                       = (known after apply)
          [32m+[0m[0m "cluster_service_cidr"               = (known after apply)
          [32m+[0m[0m "cluster_version"                    = "1.32"
        }
    }

[1m  # module.eks.module.eks-auth.kubernetes_config_map_v1_data.aws_auth[0][0m will be created
[0m  [32m+[0m[0m resource "kubernetes_config_map_v1_data" "aws_auth" {
      [32m+[0m[0m data          = {
          [32m+[0m[0m "mapAccounts" = jsonencode([])
          [32m+[0m[0m "mapRoles"    = <<-EOT
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::986323537898:role/AmazonEKSClusterRole"
                  "username": "eksadmins"
            EOT
          [32m+[0m[0m "mapUsers"    = <<-EOT
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::986323537898:group/Developers"
                  "username": "developers"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::986323537898:group/DevOps"
                  "username": "devops"
            EOT
        }
      [32m+[0m[0m field_manager = "Terraform"
      [32m+[0m[0m force         = true
      [32m+[0m[0m id            = (known after apply)

      [32m+[0m[0m metadata {
          [32m+[0m[0m name      = "aws-auth"
          [32m+[0m[0m namespace = "kube-system"
        }
    }

[1m  # module.rds.module.lambda_rds.data.aws_iam_policy_document.this[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "secretsmanager:DescribeSecret",
              [32m+[0m[0m "secretsmanager:GetSecretValue",
              [32m+[0m[0m "secretsmanager:PutSecretValue",
              [32m+[0m[0m "secretsmanager:UpdateSecretVersionStage",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m (known after apply),
            ]
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "secretsmanager:GetRandomPassword",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "secretsmanager:GetRandomPassword",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
        }
    }

[1m  # module.rds.module.rds_secret_rotate["db"].data.aws_caller_identity.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_caller_identity" "current" {
      [32m+[0m[0m account_id = (known after apply)
      [32m+[0m[0m arn        = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m user_id    = (known after apply)
    }

[1m  # module.rds.module.rds_secret_rotate["test"].data.aws_caller_identity.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_caller_identity" "current" {
      [32m+[0m[0m account_id = (known after apply)
      [32m+[0m[0m arn        = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m user_id    = (known after apply)
    }

[1m  # module.s3.module.s3_bucket[0].aws_s3_bucket.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket" "this" {
      [32m+[0m[0m acceleration_status         = (known after apply)
      [32m+[0m[0m acl                         = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m bucket                      = "dex-backend-us-east-1-terraform-state-bucket"
      [32m+[0m[0m bucket_domain_name          = (known after apply)
      [32m+[0m[0m bucket_prefix               = (known after apply)
      [32m+[0m[0m bucket_regional_domain_name = (known after apply)
      [32m+[0m[0m force_destroy               = false
      [32m+[0m[0m hosted_zone_id              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m object_lock_enabled         = false
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m region                      = (known after apply)
      [32m+[0m[0m request_payer               = (known after apply)
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m website_domain              = (known after apply)
      [32m+[0m[0m website_endpoint            = (known after apply)
    }

[1m  # module.s3.module.s3_bucket[0].aws_s3_bucket_acl.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_acl" "this" {
      [32m+[0m[0m acl    = "private"
      [32m+[0m[0m bucket = (known after apply)
      [32m+[0m[0m id     = (known after apply)
    }

[1m  # module.s3.module.s3_bucket[0].aws_s3_bucket_lifecycle_configuration.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_lifecycle_configuration" "this" {
      [32m+[0m[0m bucket                                 = (known after apply)
      [32m+[0m[0m expected_bucket_owner                  = (known after apply)
      [32m+[0m[0m id                                     = (known after apply)
      [32m+[0m[0m transition_default_minimum_object_size = "all_storage_classes_128K"

      [32m+[0m[0m rule {
          [32m+[0m[0m id     = "expire_old_versions"
          [32m+[0m[0m status = "Enabled"

          [32m+[0m[0m expiration {
              [32m+[0m[0m days                         = 90
              [32m+[0m[0m expired_object_delete_marker = false
            }

          [32m+[0m[0m filter {
            }

          [32m+[0m[0m noncurrent_version_expiration {
              [32m+[0m[0m newer_noncurrent_versions = 5
              [32m+[0m[0m noncurrent_days           = 30
            }

          [32m+[0m[0m transition {
              [32m+[0m[0m days          = 30
              [32m+[0m[0m storage_class = "STANDARD_IA"
            }
        }
    }

[1m  # module.s3.module.s3_bucket[0].aws_s3_bucket_ownership_controls.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_ownership_controls" "this" {
      [32m+[0m[0m bucket = (known after apply)
      [32m+[0m[0m id     = (known after apply)

      [32m+[0m[0m rule {
          [32m+[0m[0m object_ownership = "BucketOwnerPreferred"
        }
    }

[1m  # module.s3.module.s3_bucket[0].aws_s3_bucket_public_access_block.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_public_access_block" "this" {
      [32m+[0m[0m block_public_acls       = true
      [32m+[0m[0m block_public_policy     = true
      [32m+[0m[0m bucket                  = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ignore_public_acls      = true
      [32m+[0m[0m restrict_public_buckets = true
    }

[1m  # module.s3.module.s3_bucket[0].aws_s3_bucket_versioning.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_versioning" "this" {
      [32m+[0m[0m bucket = (known after apply)
      [32m+[0m[0m id     = (known after apply)

      [32m+[0m[0m versioning_configuration {
          [32m+[0m[0m mfa_delete = "Disabled"
          [32m+[0m[0m status     = "Enabled"
        }
    }

[1m  # module.eks.module.eks.module.eks_managed_node_group["default_node_group"].aws_eks_node_group.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_node_group" "this" {
      [32m+[0m[0m ami_type               = "BOTTLEROCKET_x86_64"
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m capacity_type          = (known after apply)
      [32m+[0m[0m cluster_name           = (known after apply)
      [32m+[0m[0m disk_size              = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_types         = [
          [32m+[0m[0m "t3.medium",
        ]
      [32m+[0m[0m node_group_name        = (known after apply)
      [32m+[0m[0m node_group_name_prefix = "default_node_group-"
      [32m+[0m[0m node_role_arn          = (known after apply)
      [32m+[0m[0m release_version        = (known after apply)
      [32m+[0m[0m resources              = (known after apply)
      [32m+[0m[0m status                 = (known after apply)
      [32m+[0m[0m subnet_ids             = [
          [32m+[0m[0m "subnet-071fec278a5cf994a",
          [32m+[0m[0m "subnet-0a0927fadad706792",
        ]
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Name"        = "default_node_group"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Name"        = "default_node_group"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m version                = "1.32"

      [32m+[0m[0m launch_template {
          [32m+[0m[0m id      = (known after apply)
          [32m+[0m[0m name    = (known after apply)
          [32m+[0m[0m version = (known after apply)
        }

      [32m+[0m[0m scaling_config {
          [32m+[0m[0m desired_size = 2
          [32m+[0m[0m max_size     = 5
          [32m+[0m[0m min_size     = 2
        }

      [32m+[0m[0m timeouts {}

      [32m+[0m[0m update_config {
          [32m+[0m[0m max_unavailable_percentage = 33
        }
    }

[1m  # module.eks.module.eks.module.eks_managed_node_group["default_node_group"].aws_iam_role.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                      [32m+[0m[0m Sid       = "EKSNodeAssumeRole"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m description           = "EKS managed node group IAM role"
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m name_prefix           = "default_node_group-eks-node-group-"
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.eks.module.eks.module.eks_managed_node_group["default_node_group"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.eks.module.eks.module.eks_managed_node_group["default_node_group"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.eks.module.eks.module.eks_managed_node_group["default_node_group"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      [32m+[0m[0m role       = (known after apply)
    }

[1m  # module.eks.module.eks.module.eks_managed_node_group["default_node_group"].aws_launch_template.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_launch_template" "this" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m default_version        = (known after apply)
      [32m+[0m[0m description            = "Custom launch template for default_node_group EKS managed node group"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m latest_version         = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "default_node_group-"
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m update_default_version = true
      [32m+[0m[0m vpc_security_group_ids = (known after apply)

      [32m+[0m[0m metadata_options {
          [32m+[0m[0m http_endpoint               = "enabled"
          [32m+[0m[0m http_protocol_ipv6          = (known after apply)
          [32m+[0m[0m http_put_response_hop_limit = 2
          [32m+[0m[0m http_tokens                 = "required"
          [32m+[0m[0m instance_metadata_tags      = (known after apply)
        }

      [32m+[0m[0m monitoring {
          [32m+[0m[0m enabled = true
        }

      [32m+[0m[0m tag_specifications {
          [32m+[0m[0m resource_type = "instance"
          [32m+[0m[0m tags          = {
              [32m+[0m[0m "Environment" = "dex-backend"
              [32m+[0m[0m "Name"        = "default_node_group"
              [32m+[0m[0m "Terraform"   = "true"
            }
        }
      [32m+[0m[0m tag_specifications {
          [32m+[0m[0m resource_type = "network-interface"
          [32m+[0m[0m tags          = {
              [32m+[0m[0m "Environment" = "dex-backend"
              [32m+[0m[0m "Name"        = "default_node_group"
              [32m+[0m[0m "Terraform"   = "true"
            }
        }
      [32m+[0m[0m tag_specifications {
          [32m+[0m[0m resource_type = "volume"
          [32m+[0m[0m tags          = {
              [32m+[0m[0m "Environment" = "dex-backend"
              [32m+[0m[0m "Name"        = "default_node_group"
              [32m+[0m[0m "Terraform"   = "true"
            }
        }
    }

[1m  # module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m json                      = (known after apply)
      [32m+[0m[0m minified_json             = (known after apply)
      [32m+[0m[0m override_policy_documents = []
      [32m+[0m[0m source_policy_documents   = []

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "kms:*",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "Default"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::986323537898:root",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "kms:CancelKeyDeletion",
              [32m+[0m[0m "kms:Create*",
              [32m+[0m[0m "kms:Delete*",
              [32m+[0m[0m "kms:Describe*",
              [32m+[0m[0m "kms:Disable*",
              [32m+[0m[0m "kms:Enable*",
              [32m+[0m[0m "kms:Get*",
              [32m+[0m[0m "kms:ImportKeyMaterial",
              [32m+[0m[0m "kms:List*",
              [32m+[0m[0m "kms:Put*",
              [32m+[0m[0m "kms:ReplicateKey",
              [32m+[0m[0m "kms:Revoke*",
              [32m+[0m[0m "kms:ScheduleKeyDeletion",
              [32m+[0m[0m "kms:TagResource",
              [32m+[0m[0m "kms:UntagResource",
              [32m+[0m[0m "kms:Update*",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "KeyAdministration"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::986323537898:role/openid-gha-role",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "kms:Decrypt",
              [32m+[0m[0m "kms:DescribeKey",
              [32m+[0m[0m "kms:Encrypt",
              [32m+[0m[0m "kms:GenerateDataKey*",
              [32m+[0m[0m "kms:ReEncrypt*",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "KeyUsage"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m (known after apply),
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
    }

[1m  # module.eks.module.eks.module.kms.aws_kms_alias.this["cluster"][0m will be created
[0m  [32m+[0m[0m resource "aws_kms_alias" "this" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m name           = "alias/eks/dex-backend-us-east-1-eks"
      [32m+[0m[0m name_prefix    = (known after apply)
      [32m+[0m[0m target_key_arn = (known after apply)
      [32m+[0m[0m target_key_id  = (known after apply)
    }

[1m  # module.eks.module.eks.module.kms.aws_kms_key.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_kms_key" "this" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m bypass_policy_lockout_safety_check = false
      [32m+[0m[0m customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      [32m+[0m[0m description                        = "dex-backend-us-east-1-eks cluster encryption key"
      [32m+[0m[0m enable_key_rotation                = true
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m is_enabled                         = true
      [32m+[0m[0m key_id                             = (known after apply)
      [32m+[0m[0m key_usage                          = "ENCRYPT_DECRYPT"
      [32m+[0m[0m multi_region                       = false
      [32m+[0m[0m policy                             = (known after apply)
      [32m+[0m[0m rotation_period_in_days            = (known after apply)
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Environment"           = "dex-backend"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "eks"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Environment"           = "dex-backend"
          [32m+[0m[0m "Terraform"             = "true"
          [32m+[0m[0m "terraform-aws-modules" = "eks"
        }
    }

[1m  # module.rds.module.lambda_rds.module.lambda.data.aws_iam_policy_document.logs[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "logs" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "logs:CreateLogGroup",
              [32m+[0m[0m "logs:CreateLogStream",
              [32m+[0m[0m "logs:PutLogEvents",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = (known after apply)
        }
    }

[1m  # module.rds.module.lambda_rds.module.lambda.aws_cloudwatch_log_group.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "lambda" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/lambda/dex-backend-us-east-1-rds-lambda-secret-rotation"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 7
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.rds.module.lambda_rds.module.lambda.aws_iam_policy.additional_json[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "additional_json" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "dex-backend-us-east-1-rds-lambda-secret-rotation"
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.rds.module.lambda_rds.module.lambda.aws_iam_policy.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "logs" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "dex-backend-us-east-1-rds-lambda-secret-rotation-logs"
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.rds.module.lambda_rds.module.lambda.aws_iam_role.lambda[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "lambda" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "dex-backend-us-east-1-rds-lambda-secret-rotation"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # module.rds.module.lambda_rds.module.lambda.aws_iam_role_policy_attachment.additional_json[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional_json" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "dex-backend-us-east-1-rds-lambda-secret-rotation"
    }

[1m  # module.rds.module.lambda_rds.module.lambda.aws_iam_role_policy_attachment.logs[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "logs" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "dex-backend-us-east-1-rds-lambda-secret-rotation"
    }

[1m  # module.rds.module.lambda_rds.module.lambda.aws_lambda_function.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "this" {
      [32m+[0m[0m architectures                  = (known after apply)
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m description                    = "Secrets Manager secret rotation lambda function"
      [32m+[0m[0m filename                       = "builds/a7376a61de666eee09d1d84a74a2c60e63c32818cf1dcfb0c95aadc522820c9c.zip"
      [32m+[0m[0m function_name                  = "dex-backend-us-east-1-rds-lambda-secret-rotation"
      [32m+[0m[0m handler                        = "function.lambda_handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 512
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = true
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "python3.10"
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = (known after apply)
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m timeout                        = 60
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m ephemeral_storage {
          [32m+[0m[0m size = 512
        }
    }

[1m  # module.rds.module.lambda_rds.module.lambda.aws_lambda_permission.current_version_triggers["secrets"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "current_version_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "dex-backend-us-east-1-rds-lambda-secret-rotation"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "secretsmanager.amazonaws.com"
      [32m+[0m[0m qualifier           = (known after apply)
      [32m+[0m[0m statement_id        = "secrets"
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # module.rds.module.lambda_rds.module.lambda.aws_lambda_permission.unqualified_alias_triggers["secrets"][0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_permission" "unqualified_alias_triggers" {
      [32m+[0m[0m action              = "lambda:InvokeFunction"
      [32m+[0m[0m function_name       = "dex-backend-us-east-1-rds-lambda-secret-rotation"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m principal           = "secretsmanager.amazonaws.com"
      [32m+[0m[0m statement_id        = "secrets"
      [32m+[0m[0m statement_id_prefix = (known after apply)
    }

[1m  # module.rds.module.lambda_rds.module.lambda.local_file.archive_plan[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "archive_plan" {
      [32m+[0m[0m content              = jsonencode(
            {
              [32m+[0m[0m artifacts_dir = "builds"
              [32m+[0m[0m build_plan    = [
                  [32m+[0m[0m [
                      [32m+[0m[0m "zip",
                      [32m+[0m[0m "../../modules/lambda/secretrotation/function.py",
                      [32m+[0m[0m [90mnull[0m[0m,
                    ],
                ]
              [32m+[0m[0m filename      = "builds/a7376a61de666eee09d1d84a74a2c60e63c32818cf1dcfb0c95aadc522820c9c.zip"
              [32m+[0m[0m runtime       = "python3.10"
            }
        )
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0755"
      [32m+[0m[0m file_permission      = "0644"
      [32m+[0m[0m filename             = "builds/a7376a61de666eee09d1d84a74a2c60e63c32818cf1dcfb0c95aadc522820c9c.plan.json"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.rds.module.lambda_rds.module.lambda.null_resource.archive[0][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "archive" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "filename"  = "builds/a7376a61de666eee09d1d84a74a2c60e63c32818cf1dcfb0c95aadc522820c9c.zip"
          [32m+[0m[0m "timestamp" = "1748272917638950200"
        }
    }

[1m  # module.rds.module.rds_secret_rotate["db"].module.secrets_manager_rotate.data.aws_iam_policy_document.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m json                      = (known after apply)
      [32m+[0m[0m minified_json             = (known after apply)
      [32m+[0m[0m override_policy_documents = []
      [32m+[0m[0m source_policy_documents   = []

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "secretsmanager:DescribeSecret",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "AccountDescribe"
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "secretsmanager:DescribeSecret",
              [32m+[0m[0m "secretsmanager:GetSecretValue",
              [32m+[0m[0m "secretsmanager:PutSecretValue",
              [32m+[0m[0m "secretsmanager:UpdateSecretVersionStage",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "LambdaReadWrite"
        }
    }

[1m  # module.rds.module.rds_secret_rotate["db"].module.secrets_manager_rotate.aws_secretsmanager_secret.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret" "this" {
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m description                    = "Rotated Secrets Manager secret"
      [32m+[0m[0m force_overwrite_replica_secret = false
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m name                           = (known after apply)
      [32m+[0m[0m name_prefix                    = "dex-backend-us-east-1-db-rds-secret"
      [32m+[0m[0m policy                         = (known after apply)
      [32m+[0m[0m recovery_window_in_days        = 0
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.rds.module.rds_secret_rotate["db"].module.secrets_manager_rotate.aws_secretsmanager_secret_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_policy" "this" {
      [32m+[0m[0m block_public_policy = true
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m policy              = (known after apply)
      [32m+[0m[0m secret_arn          = (known after apply)
    }

[1m  # module.rds.module.rds_secret_rotate["db"].module.secrets_manager_rotate.aws_secretsmanager_secret_rotation.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_rotation" "this" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m rotate_immediately  = true
      [32m+[0m[0m rotation_enabled    = (known after apply)
      [32m+[0m[0m rotation_lambda_arn = (known after apply)
      [32m+[0m[0m secret_id           = (known after apply)

      [32m+[0m[0m rotation_rules {
          [32m+[0m[0m schedule_expression = "rate(15 days)"
        }
    }

[1m  # module.rds.module.rds_secret_rotate["db"].module.secrets_manager_rotate.aws_secretsmanager_secret_version.ignore_changes[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_version" "ignore_changes" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m has_secret_string_wo = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m secret_id            = (known after apply)
      [32m+[0m[0m secret_string        = (sensitive value)
      [32m+[0m[0m version_id           = (known after apply)
      [32m+[0m[0m version_stages       = (known after apply)
    }

[1m  # module.rds.module.rds_secret_rotate["test"].module.secrets_manager_rotate.data.aws_iam_policy_document.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m json                      = (known after apply)
      [32m+[0m[0m minified_json             = (known after apply)
      [32m+[0m[0m override_policy_documents = []
      [32m+[0m[0m source_policy_documents   = []

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "secretsmanager:DescribeSecret",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "AccountDescribe"
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "secretsmanager:DescribeSecret",
              [32m+[0m[0m "secretsmanager:GetSecretValue",
              [32m+[0m[0m "secretsmanager:PutSecretValue",
              [32m+[0m[0m "secretsmanager:UpdateSecretVersionStage",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "LambdaReadWrite"
        }
    }

[1m  # module.rds.module.rds_secret_rotate["test"].module.secrets_manager_rotate.aws_secretsmanager_secret.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret" "this" {
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m description                    = "Rotated Secrets Manager secret"
      [32m+[0m[0m force_overwrite_replica_secret = false
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m name                           = (known after apply)
      [32m+[0m[0m name_prefix                    = "dex-backend-us-east-1-test-rds-secret"
      [32m+[0m[0m policy                         = (known after apply)
      [32m+[0m[0m recovery_window_in_days        = 0
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.rds.module.rds_secret_rotate["test"].module.secrets_manager_rotate.aws_secretsmanager_secret_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_policy" "this" {
      [32m+[0m[0m block_public_policy = true
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m policy              = (known after apply)
      [32m+[0m[0m secret_arn          = (known after apply)
    }

[1m  # module.rds.module.rds_secret_rotate["test"].module.secrets_manager_rotate.aws_secretsmanager_secret_rotation.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_rotation" "this" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m rotate_immediately  = true
      [32m+[0m[0m rotation_enabled    = (known after apply)
      [32m+[0m[0m rotation_lambda_arn = (known after apply)
      [32m+[0m[0m secret_id           = (known after apply)

      [32m+[0m[0m rotation_rules {
          [32m+[0m[0m schedule_expression = "rate(15 days)"
        }
    }

[1m  # module.rds.module.rds_secret_rotate["test"].module.secrets_manager_rotate.aws_secretsmanager_secret_version.ignore_changes[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_version" "ignore_changes" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m has_secret_string_wo = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m secret_id            = (known after apply)
      [32m+[0m[0m secret_string        = (sensitive value)
      [32m+[0m[0m version_id           = (known after apply)
      [32m+[0m[0m version_stages       = (known after apply)
    }

[1m  # module.rds.module.rds_sg.module.security_group.aws_security_group.this_name_prefix[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "this_name_prefix" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Complete PostgreSQL example security group"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "dex-backend-us-east-1-rds-master-sg-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Name"        = "dex-backend-us-east-1-rds-master-sg"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Name"        = "dex-backend-us-east-1-rds-master-sg"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m vpc_id                 = "vpc-0942df3048e39f7e9"

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "10m"
          [32m+[0m[0m delete = "15m"
        }
    }

[1m  # module.rds.module.rds_sg.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "10.0.0.0/16",
        ]
      [32m+[0m[0m description              = "PostgreSQL access from within VPC"
      [32m+[0m[0m from_port                = 5432
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 5432
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.rds.module.secret_manager.module.secrets_manager.aws_secretsmanager_secret.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret" "this" {
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m description                    = "Secrets Manager"
      [32m+[0m[0m force_overwrite_replica_secret = false
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m name                           = (known after apply)
      [32m+[0m[0m name_prefix                    = "dex-backend-us-east-1-rds-sec-mgr"
      [32m+[0m[0m policy                         = (known after apply)
      [32m+[0m[0m recovery_window_in_days        = 0
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment" = "dex-backend"
          [32m+[0m[0m "Owner"       = "dex-backend"
          [32m+[0m[0m "Terraform"   = "true"
        }
    }

[1m  # module.rds.module.secret_manager.module.secrets_manager.aws_secretsmanager_secret_policy.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_policy" "this" {
      [32m+[0m[0m block_public_policy = true
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m policy              = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "secretsmanager:GetSecretValue"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m AWS = "arn:aws:iam::986323537898:root"
                        }
                      [32m+[0m[0m Resource  = "*"
                      [32m+[0m[0m Sid       = "AllowAccountRead"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "secretsmanager:PutSecretValue"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m AWS = "arn:aws:iam::986323537898:root"
                        }
                      [32m+[0m[0m Resource  = "*"
                      [32m+[0m[0m Sid       = "AllowRotation"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m secret_arn          = (known after apply)
    }

[1m  # module.rds.module.secret_manager.module.secrets_manager.aws_secretsmanager_secret_version.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_version" "this" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m has_secret_string_wo = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m secret_id            = (known after apply)
      [32m+[0m[0m secret_string        = (sensitive value)
      [32m+[0m[0m version_id           = (known after apply)
      [32m+[0m[0m version_stages       = (known after apply)
    }

[1m  # module.rds.module.secret_manager.module.secrets_manager.random_password.this[0][0m will be created
[0m  [32m+[0m[0m resource "random_password" "this" {
      [32m+[0m[0m bcrypt_hash      = (sensitive value)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m length           = 11
      [32m+[0m[0m lower            = true
      [32m+[0m[0m min_lower        = 0
      [32m+[0m[0m min_numeric      = 0
      [32m+[0m[0m min_special      = 0
      [32m+[0m[0m min_upper        = 0
      [32m+[0m[0m number           = true
      [32m+[0m[0m numeric          = true
      [32m+[0m[0m override_special = "!@#$%^&*()_+"
      [32m+[0m[0m result           = (sensitive value)
      [32m+[0m[0m special          = true
      [32m+[0m[0m upper            = true
    }

[1m  # module.eks.module.eks.module.eks_managed_node_group["default_node_group"].module.user_data.null_resource.validate_cluster_service_cidr[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "validate_cluster_service_cidr" {
      [32m+[0m[0m id = (known after apply)
    }

[1mPlan:[0m 100 to add, 0 to change, 3 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @freelancedevsecops, Action: `pull_request`, Working Directory: `dex_backend`, Workflow: `Terraform Multi-Account Deployment`*